#+TITLE: June 4-16, 2019 (13 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:17]"
#+BEGIN: block-update-burndown
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 13
  :SPRINTSTART: <2019-06-04 Tue>
  :wpd-akshay196: 1
  :wpd-bhavin192: 1
  :wpd-jasonbraganza: 4
  :wpd-sandeepk: 2
  :END:
** akshay196
*** Read [[https://debbugs.gnu.org/][GNU Bug Tracker]]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1559574004
    :TASKID: READ.1559574004
    :END:
*** Read [[https://debbugs.gnu.org/Using.html][Using this system to track your project's bug]]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1559574102
    :TASKID: READ.1559574102
    :END:
*** Read [[https://debbugs.gnu.org/server-control.html][Introduction to the bug control mailserver]]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1559574200
    :TASKID: READ.1559574200
    :END:
*** Read [[https://debbugs.gnu.org/server-request.html][Introduction to the bug system request server]]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1559574236
    :TASKID: READ.1559574236
    :END:
*** Read [[https://debbugs.gnu.org/Developer.html][Developers' information regarding the bug processing system]]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1559574679
    :TASKID: READ.1559574679
    :END:
*** Build GNU Emacs from source code
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: akshay196
    :ID: OPS.1559574312
    :TASKID: OPS.1559574312
    :END:
*** Read [[https://treyhunner.com/2016/04/how-to-loop-with-indexes-in-python/][How to loop with indexes in Python]]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1559574998
    :TASKID: READ.1559574998
    :END:
*** Read [[https://treyhunner.com/2015/12/python-list-comprehensions-now-in-color/][Python List Comprehensions]]
    :PROPERTIES:
    :ESTIMATED: 1
    :ACTUAL:
    :OWNER: akshay196
    :ID: READ.1559575032
    :TASKID: READ.1559575032
    :END:
** bhavin192
*** Write blog post on building Emacs from source
    :PROPERTIES:
    :ESTIMATED: 4
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       WRITE.1556025699
    :TASKID:   WRITE.1556025699
    :END:
*** Linux Under the Hood [0/13]
    :PROPERTIES:
    :ESTIMATED: 10
    :ACTUAL:
    :OWNER:    bhavin192
    :ID:       READ.1559581076
    :TASKID:   READ.1559581076
    :END:
    https://www.oreilly.com/library/view/linux-under-the/9780134663500/
    - [ ] 1.  How Linux is organized                            (25m)
    - [ ] 2.  About C code, scripts and compiled programs       (35m)
    - [ ] 3.  Understanding Linux commands and how they work    (22m)
    - [ ] 4.  Understanding the Linux boot procedure            (90m)
    - [ ] 5.  Understanding Linux storage                       (80m)
    - [ ] 6.  Understanding memory management                   (40m)
    - [ ] 7.  Understanding processes                           (40m)
    - [ ] 8.  Security                                          (60m)
    - [ ] 9.  Hardware initialization                           (35m)
    - [ ] 10. Looking closer at the kernel                      (40m)
    - [ ] 11. Understanding networking                          (50m)
    - [ ] 12. Performance optimization                          (60m)
    - [ ] 13. The future of Linux                               (23m)
** jasonbraganza
*** IN_PROGRESS Work at French, in the Fluent forever app - Part III [3/10]
   :PROPERTIES:
   :ESTIMATED: 20
   :ACTUAL:   2.88
   :OWNER: jasonbraganza
   :ID: WRITE.1557903518
   :TASKID: WRITE.1557903518
   :END:
   :LOGBOOK:
   CLOCK: [2019-06-06 Thu 07:15]--[2019-06-06 Thu 08:04] =>  0:49
   CLOCK: [2019-06-05 Wed 08:06]--[2019-06-05 Wed 08:55] =>  0:49
   CLOCK: [2019-06-04 Tue 07:50]--[2019-06-04 Tue 09:05] =>  1:15
   :END:
   - [X] Completed 1 review session & 2 pronunciation lessons (1h)
   - [X] Completed 1 review session & 2 pronunciation lessons (1h)
   - [X] Completed 1 review session & 2 pronunciation lessons (1h)
   - [ ] Complete lesson and fill details, write blog post (1h)
   - [ ] Complete lesson and fill details (1h)
   - [ ] Complete lesson and fill details (1h)
   - [ ] Complete lesson and fill details (1h)
   - [ ] Complete lesson and fill details (1h)
   - [ ] Complete lesson and fill details, write blog post (1h)
   - [ ] Complete lesson and fill details (1h)
*** IN_PROGRESS Write once a week - 1 [1/2]
   :PROPERTIES:
   :ESTIMATED: 2
   :ACTUAL:   0.65
   :OWNER: jasonbraganza
   :ID: WRITE.1559630427
   :TASKID: WRITE.1559630427
   :END:
   :LOGBOOK:
   CLOCK: [2019-06-04 Tue 14:00]--[2019-06-04 Tue 14:39] =>  0:39
   :END:
   - [X] Write a short blog post. (1h)
   - [ ] Write a short blog post. (1h)
*** IN_PROGRESS Read fiction [6/10]
   :PROPERTIES:
   :ESTIMATED: 10
   :ACTUAL:   4.13
   :OWNER: jasonbraganza
   :ID: READ.1559630918
   :TASKID: READ.1559630918
   :END:
   :LOGBOOK:
   CLOCK: [2019-06-06 Thu 11:00]--[2019-06-06 Thu 13:01] =>  2:01
   CLOCK: [2019-06-05 Wed 23:35]--[2019-06-06 Thu 00:45] =>  1:10
   CLOCK: [2019-06-05 Wed 09:09]--[2019-06-05 Wed 09:11] =>  0:02
   CLOCK: [2019-06-04 Tue 13:00]--[2019-06-04 Tue 13:55] =>  0:55
   :END:
   - [X] Read India Love Poems (1h)
   - [X] Read Love Poems & Love Letters (1h)
   - [X] Read Flower thoughts (1h)
   - [X] Read Thoughts for a Good Life (1h)
   - [X] Read Oscar Wilde Epigrams (1h)
   - [X] Read Balzac Epigrams (1h)
   - [ ] Read Murder on the Links (1h)
   - [ ] Read Murder on the Links (1h)
   - [ ] Read Murder on the Links (1h)
   - [ ] Read Murder on the Links (1h)
*** IN_PROGRESS Introduction to Computer Science and Programming Using Python - Part I [0/3]
   :PROPERTIES:
   :ESTIMATED: 8
   :ACTUAL:   2.38
   :OWNER: jasonbraganza
   :ID: READ.1559713451
   :TASKID: READ.1559713451
   :END:
   :LOGBOOK:
   CLOCK: [2019-06-06 Thu 08:30]--[2019-06-06 Thu 10:00] =>  1:30
   CLOCK: [2019-06-05 Wed 22:37]--[2019-06-05 Wed 23:30] =>  0:53
   :END:
   - [-] 1. Introduction to Python (TIME: 1:03:12)
     - [X] Finger Exercises due Aug 8, 2019 05:00 IST  This content is graded
     - [X] Video: Introduction
     - [X] Video: Knowledge
     - [X] Exercises 1
     - [X] Exercises 2
     - [X] Video: Machines
     - [X] Exercises 3
     - [X] Video: Languages
     - [X] Exercises 4
     - [ ] Video: Types
     - [ ] Exercise 5
     - [ ] Exercise 6
     - [ ] Video: Variables
     - [ ] Exercise 7
     - [ ] Video: Operators and Branching
     - [ ] Exercise 8
     - [ ] Exercise 9
     - [ ] Exercise 10
   - [ ] 2. Core Elements of Programs (TIME: 54:14)
     - [ ] Video: Bindings
     - [ ] Video: Strings
     - [ ] Exercise 1
     - [ ] Exercise 2
     - [ ] Video: Input/Output
     - [ ] Exercise 3
     - [ ] Video: IDEs
     - [ ] Exercise: hello world
     - [ ] Video: Control Flow
     - [ ] Exercise: happy
     - [ ] Exercise: vara varb
     - [ ] Exercise 4
     - [ ] Exercise: while
     - [ ] Exercise: for
     - [ ] Video: Iteration
     - [ ] Exercise 5
     - [ ] Exercise 6
     - [ ] Video: Guess and Check
     - [ ] Exercise 7
   - [ ] Problem Set 1, due Jun 21, 2019 05:00 IST
     - [ ] Problem 1
     - [ ] Problem 2
     - [ ] Problem 3
     - [ ] Show your Appreciation!
** sandeepk
*** Essential Cloud Infrastructure: Foundation [0/4]
    :PROPERTIES:
    :ESTIMATED: 5
    :ACTUAL:
    :OWNER: sandeepk
    :ID: READ.1559492157
    :TASKID: READ.1559492157
    :END:
    - [ ] Welcome to cloud Infrastructure on Google Cloud Platform        (25m)
    - [ ] Module - 1 Introduction to Google Cloud Platform Infrastructure (50m)
    - [ ] Module - 2 Virtual Networking                                   (1h 40m)
    - [ ] Module - 3 Virtual Macgines                                     (2h 5m)
*** Essential Cloud Infrastructure: Core Services [/5]
    :PROPERTIES:
    :ESTIMATED: 7.08
    :ACTUAL:
    :OWNER: sandeepk
    :ID: READ.1559587761
    :TASKID: READ.1559587761
    :END:
    - [ ] Welcome to Essential Cloud Infrastructure: Core Services (5m)
    - [ ] Module 1: Cloud IAM                                      (1h)
    - [ ] Module 2: Data Storage Services                          (3h)
    - [ ] Module 3: Resource Management                            (1h)
    - [ ] Module 4: Resource Monitoring                            (2h)
*** Elastic Cloud Infrastructure: Scaling and Automation [/7]
    :PROPERTIES:
    :ESTIMATED: 6.41
    :ACTUAL:
    :OWNER: sandeepk
    :ID: READ.1559588072
    :TASKID: READ.1559588072
    :END:
    - [ ] Welcome to Elastic Cloud Infrastructure: Scaling and Automation (5m)
    - [ ] Module 1: Interconnecting Networks                              (2h)
    - [ ] Module 2: Load Balancing                                        (2h)
    - [ ] Module 3: Autoscaling                                           (1h)
    - [ ] Module 4: Infrastructure Automation with Cloud API              (2h)
    - [ ] Module 5: Infrastructure Automation with Deployment Manager     (1h)
    - [ ] Module 6: Managed Services                                      (20m)
*** Elastic Cloud Infrastructure: Containers and Services [/4]
    :PROPERTIES:
    :ESTIMATED: 2
    :ACTUAL:
    :OWNER: sandeepk
    :ID: READ.1559588275
    :TASKID: READ.1559588275
    :END:
    - [ ] Welcome to Elastic Infrastructure: Containers and Services (5m)
    - [ ] Module 1: Application Infrastructure Services              (30m)
    - [ ] Module 2: Application Development Services                 (20m)
    - [ ] Module 3: Containers                                       (1h)
*** Reliable Cloud Infrastructure: Design and Process [/3]
    :PROPERTIES:
    :ESTIMATED: 2.33
    :ACTUAL:
    :OWNER: sandeepk
    :ID: READ.1559588374
    :TASKID: READ.1559588374
    :END:
    - [ ] Welcome to Design and Process (20m)
    - [ ] Defining the Service          (3h)
    - [ ] Business-logic Layer Design   (3h)
